//***************************************************************************
// 
// 파일: math_defines.h
// 
// 설명: 수학 관련 상수 정의
// 
// 작성자: bumpsgoodman
// 
// 작성일: 2023/09/27
// 
//***************************************************************************

#ifndef MATH_DEFINES_H
#define MATH_DEFINES_H

#define PI_1_DIV_2PI 0.15915494309189533576
#define PI 3.14159265358979323846
#define TWO_PI 6.28318530717958647692
#define PI_DIV_2 1.57079632679489661923
#define PI_DIV_4 0.785398163397448309616
#define PI_1_DIV_PI 0.318309886183790671538
#define PI_DIV_180 0.017453292519943295769

#endif // MATH_DEFINES_H